# tasks/reward/guangyi.py
from core.utils import 缩放区域

from tasks.reward.base import 强化奖励任务基类
from core.debug import 调试器
import time,random

class 光翼系列强化(强化奖励任务基类):
    任务ID = "guangyi"
    任务名称 = "光翼系列强化"  
    是否启用: bool = True  
    最小间隔秒 = 300
    最大间隔秒 = 600
    
    def 执行(self) -> bool:
        调试器.debug("强化奖励", "光翼系列强化: 开始检查")
        #程序奇葩，这个光翼不能正常同步红点、        
        # if not self.页面.合成强化.进入小菜单带红点(self.配置.区域.主界面.光翼按钮带红点区域标签.元组,
        #                              "光|翼"
        #                    ):            
        #     self.下次执行时间 = time.time() + random.randint(180, 600)
        #     调试器.debug("强化奖励", "光翼系列强化: 进入光翼失败")
        #     return False
        if not self.页面.创建_通用点击区域验证文字切换(
            缩放区域(self.配置.区域.主界面.光翼按钮带红点区域标签.元组,0.5),
            self.配置.区域.主界面.中间页面名称区域标签.元组,
            "光|翼"
        ).执行():
            self.下次执行时间 = time.time() + random.randint(180, 600)
            调试器.debug("强化奖励", "光翼系列强化: 进入光翼失败")
            return False
        # 按顺序处理各模块
        self._神兵升级()
        self._幻装强化()
        self._星辰提升()        
        return True


    def _幻装强化(self) -> None:
        """强星强化"""
        右侧卡区域 = self.辅助识别器.线程.动态标签.光翼页面右侧标签.幻装.元组
        if not self.辅助识别器.查找图片单结果(缩放区域(右侧卡区域, 1.6), "红点1.bmp"):
            return
         # 打开幻装页面
        if not self.页面.创建_通用点击区域验证文字切换(
            右侧卡区域,
            self.配置.区域.主界面.中间页面名称区域标签.元组,
            "幻装"
         ).执行():
            return 
        调试器.debug("强化奖励", "执行幻装强化")
        for _ in range(3):
            for _ in range(10):
                #上部选项卡筛选有提示的
                if self.页面.创建寻图偏移点击操作(
                    self.配置.区域.日常强化.幻装上部分页卡红点范围区域.元组,
                    "左半红点.bmp",
                    (-5, 5, 2, 20),
                ).执行():
                    self.页面.线程.刷新截图()
                    
                    for _ in range(6):
                        if self.页面.创建寻图偏移点击操作(
                            self.配置.区域.日常强化.幻装激活球带红点范围区域.元组,
                            "左半红点.bmp",
                            (-20, 5, 0, 20),
                        ).执行():
                            self.页面.线程.刷新截图()
                            self.页面.创建_通用点击区域验证文字切换(
                                self.配置.区域.日常强化.幻装激活球激活按钮区域.元组,
                                self.配置.区域.日常强化.幻装激活球激活按钮区域.元组,
                                "已|己"
                            ).执行()
                        else:
                            break
                    if self.页面.创建寻图偏移点击验证文字切换(
                            self.配置.区域.日常强化.幻装累计属性按钮带红点区域.元组,
                            "左半红点.bmp",
                            (-20, 5, 0, 20),
                            self.配置.区域.日常强化.幻装长安升级按钮区域.元组,
                            "长",
                        ).执行():
                        for _ in range(150):
                            像素统计= self.辅助识别器.区域像素统计(self.配置.区域.日常强化.幻装长安升级完成颜色核对区域.元组, "0105FF,0.9|02EF28,0.9|FFFFFF,0.9")
                            if 像素统计 and 像素统计[2] > 0:
                                if 像素统计[0] > 0:break
                                if 像素统计[1] > 0:
                                    self.通用操作.点击区域(self.配置.区域.日常强化.幻装长安升级按钮区域.元组,3,0.2)
                                    time.sleep(self.页面.线程.游戏配置.默认等待秒)
                                    self.页面.线程.刷新截图()
                                else:
                                    break
                    self.页面.创建_通用点击图片验证图片切换(
                        self.配置.区域.日常强化.幻装长安升级页关闭区域标签.元组,
                        "关闭按钮.bmp", 
                        self.配置.区域.日常强化.幻装长安升级页关闭区域标签.元组,
                        "关闭按钮.bmp", 
                        False,
                    ).执行()   
                else:
                    break
            if not self.辅助识别器.查找图片单结果(缩放区域(右侧卡区域, 1.6), "红点1.bmp"):
                 return
            x, y = self.配置.区域.日常强化.幻装上部分页卡红点范围区域.随机点(0.3)
            self.动作.drag(x, y, x - 500, y)
            time.sleep(self.配置.默认等待秒)
            self.页面.线程.刷新截图()

    def _神兵升级(self) -> None:
        """神兵升级：升级天赋-点击天赋 → 点击升级按钮"""
        右侧卡区域 = self.辅助识别器.线程.动态标签.光翼页面右侧标签.神兵.元组
        if not self.辅助识别器.查找图片单结果(缩放区域(右侧卡区域, 1.6), "红点1.bmp"):
            return
        if not self.页面.创建_通用点击区域验证文字切换(
            右侧卡区域,
            self.配置.区域.主界面.中间页面名称区域标签.元组,
            "神|兵"
        ).执行():
            return
        
        self._重复点击红点(
                self.配置.区域.日常强化.神兵升级按钮带红点范围区域,
                最大次数=100,
                点击缩放=0.3
            )
        
        for _ in range(3):
            # 点击有红点的装备
            if not self.页面.创建寻图偏移点击验证文字切换(
                self.配置.区域.日常强化.神兵全天赋按钮带红点范围区域.元组,
                "左半红点.bmp",
                (-30, 15, -5, 35),
                self.配置.区域.日常强化.神兵等级升级按钮区域.元组,
                "升",
            ).执行():
                break
            
            self.页面.线程.刷新截图()
            
            # 反复点击升级按钮            
            self.通用操作.点击区域(self.配置.区域.日常强化.神兵等级升级按钮区域.元组,3,0.35)

    def _星辰提升(self) -> None:
        """星辰提升：重复点击提升按钮"""
        右侧卡区域 = self.辅助识别器.线程.动态标签.光翼页面右侧标签.星辰.元组
        if not self.辅助识别器.查找图片单结果(缩放区域(右侧卡区域, 1.6), "红点1.bmp"):
            return
        if not self.页面.创建_通用点击区域验证文字切换(
            右侧卡区域,
            self.配置.区域.主界面.中间页面名称区域标签.元组,
            "星|辰"
        ).执行():
            return
        for _ in range(3):
            self._重复点击红点(
                self.配置.区域.日常强化.星辰升级按钮带红点标签,
                最大次数=5,
                点击缩放=0.3
            )
            if not self.页面.创建寻图偏移点击操作(
                self.配置.区域.日常强化.星辰升级切换带红点标签.元组,
                "左半红点.bmp",
                (0, 0, 8, 10),                
            ).执行():
                break
            self.页面.线程.刷新截图()
      
